src/cfe/InformationRegisters/OData4_Состав.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Состав</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключённыеТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключённыеПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_СоставСтандартногоИнтерфейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_СоставСтандартногоИнтерфейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_Состав/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Действующий состав публикации: Соответствие «полное имя объекта метаданных → Структура
// (ИсключённыеТЧ, ИсключённыеПоля — массивы имён 1С)». Пока в регистре OData4_Состав нет ни одной записи,
// действует состав стандартного интерфейса OData. Записи с Включён = Ложь в состав не входят,
// но делают регистр непустым.
Функция ДействующийСостав() Экспорт
	Возврат СоставПоСтрокам(ПрочитатьСостав().Строки);
КонецФункции

// Состав по строкам регистра (см. ПрочитатьСостав): нет строк — состав стандартного интерфейса.
Функция СоставПоСтрокам(Строки) Экспорт
	Если Строки = Неопределено Или Строки.Количество() = 0 Тогда
		Возврат СоставСтандартногоИнтерфейса();
	КонецЕсли;
	Состав = Новый Соответствие;
	Для Каждого Строка0 Из Строки Цикл
		Если Строка0.Включён Тогда
			Состав.Вставить(Строка0.ПолноеИмя, ОписаниеОбъекта(Строка0.ТЧ, Строка0.Поля));
		КонецЕсли;
	КонецЦикла;
	Возврат Состав;
КонецФункции

// Одно чтение регистра: Структура «Ключ, Строки». Строки — ТаблицаЗначений (ПолноеИмя, Включён, ТЧ, Поля)
// по возрастанию ПолноеИмя; Ключ — "СИ" для пустого регистра, иначе "С" и SHA-256 строк. Модель строится по
// тем же строкам, по которым посчитан ключ.
Функция ПрочитатьСостав() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	С.ПолноеИмя КАК ПолноеИмя,
		|	С.Включён КАК Включён,
		|	С.ИсключённыеТабличныеЧасти КАК ТЧ,
		|	С.ИсключённыеПоля КАК Поля
		|ИЗ
		|	РегистрСведений.OData4_Состав КАК С
		|УПОРЯДОЧИТЬ ПО
		|	ПолноеИмя");
	Строки = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выгрузить();
	Если Строки.Количество() = 0 Тогда
		Возврат Новый Структура("Ключ, Строки", КлючСтандартного(), Строки);
	КонецЕсли;
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Для Каждого Строка0 Из Строки Цикл
		Хеш.Добавить(Строка0.ПолноеИмя + "|" + ?(Строка0.Включён, "1", "0") + "|" + Строка0.ТЧ + "|" + Строка0.Поля
			+ Символы.ПС);
	КонецЦикла;
	Возврат Новый Структура("Ключ, Строки", "С" + НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма)), Строки);
КонецФункции

// Состав текущего запроса (Структура «Ключ, Строки», см. ПрочитатьСостав). Чтение регистра на пути запроса
// может упасть в сеансе, где таблицы расширения недоступны (решение 19 этапа 4): тогда — последний
// прочитанный состав этого сеанса, а без него — 503.
Функция СоставЗапроса() Экспорт
	Память = OData4_МодельКэш.ПамятьСеанса();
	Попытка
		Прочитанный = ПрочитатьСостав();
	Исключение
		Информация = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("OData4.Состав", УровеньЖурналаРегистрации.Предупреждение, , ,
			ПодробноеПредставлениеОшибки(Информация));
		Прочитанный = Память.Получить("СоставЗапроса");
		Если Прочитанный = Неопределено Тогда
			OData4_Сервис.ОшибкаOData(503, "ServiceUnavailable", "Состав публикации недоступен "
				+ "(подробности — в журнале регистрации, событие OData4.Состав)");
		КонецЕсли;
		Возврат Прочитанный;
	КонецПопытки;
	Память.Вставить("СоставЗапроса", Прочитанный);
	Возврат Прочитанный;
КонецФункции

// Состав стандартного интерфейса OData: объекты публикуемых видов без исключений.
// ПолучитьСоставСтандартногоИнтерфейсаOData() доступна только с правами администратора (проба 5.2), поэтому состав
// хранится снимком в регистре OData4_СоставСтандартногоИнтерфейса: с правами — состав платформы (снимок
// обновляется, если отличается), без прав — снимок (читается запросом), а без снимка — 503.
Функция СоставСтандартногоИнтерфейса() Экспорт
	Состав = Новый Соответствие;
	Для Каждого ПолноеИмя Из ИменаСтандартногоИнтерфейса() Цикл
		Состав.Вставить(ПолноеИмя, ОписаниеОбъекта("", ""));
	КонецЦикла;
	Возврат Состав;
КонецФункции

// Записывает снимок состава стандартного интерфейса (нужны права администратора). Возвращает число объектов.
// Вызывается при развёртывании (devcli deploy) и командой devcli snapshot.
Функция ОбновитьСнимокСтандартногоИнтерфейса() Экспорт
	Имена = ИменаПлатформы();
	СохранитьСнимок(Имена);
	Возврат Имена.Количество();
КонецФункции

// Версия снимка стандартного интерфейса (SHA-256 отсортированных имён); снимка нет — "". Читается запросом.
Функция ВерсияСнимка() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 С.Версия КАК Версия ИЗ РегистрСведений.OData4_СоставСтандартногоИнтерфейса КАК С");
	Выборка = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Версия, "");
КонецФункции

// Перезаписывает регистр копией состава стандартного интерфейса.
Процедура ЗаполнитьИзСтандартногоИнтерфейса() Экспорт
	НаборЗаписей = РегистрыСведений.OData4_Состав.СоздатьНаборЗаписей();
	Для Каждого КлючИЗначение Из СоставСтандартногоИнтерфейса() Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.ПолноеИмя = КлючИЗначение.Ключ;
		Запись.Включён = Истина;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

// Вид объекта по полному имени публикуется моделью.
Функция ПубликуемыйВид(ПолноеИмя) Экспорт
	Вид = СтрРазделить(ПолноеИмя, ".")[0];
	Возврат СтрНайти(",Справочник,Документ,ПланВидовХарактеристик,ПланОбмена,ПланВидовРасчета,ПланСчетов,"
		+ "БизнесПроцесс,Задача,Константа,ЖурналДокументов,РегистрСведений,РегистрНакопления,"
		+ "РегистрБухгалтерии,РегистрРасчета,", "," + Вид + ",") > 0;
КонецФункции

// Описание объекта состава по спискам из регистра: имена 1С через запятую; поле табличной части —
// «ИмяТЧ.ИмяРеквизита», стандартный реквизит — по русскому имени.
Функция ОписаниеОбъекта(ИсключённыеТЧ, ИсключённыеПоля) Экспорт
	Возврат Новый Структура("ИсключённыеТЧ, ИсключённыеПоля", СписокИмён(ИсключённыеТЧ), СписокИмён(ИсключённыеПоля));
КонецФункции

// Ключ состава текущего запроса для кэша модели: "СИ" — регистр пуст (стандартный интерфейс), иначе "С" и
// хеш строк (см. СоставЗапроса: при гонке — последний ключ сеанса или 503).
Функция КлючСостава() Экспорт
	Возврат СоставЗапроса().Ключ;
КонецФункции

// Ключ состава без запасного варианта.
Функция ПрочитатьКлючСостава() Экспорт
	Возврат ПрочитатьСостав().Ключ;
КонецФункции


// Предупреждения о составе: Массив Структура("Вид, Объект, Текст"). Сохранять состав они не мешают.
// Виды: ПустойСостав, НеПубликуется, ВнеСтандартногоИнтерфейса, ПолеКлюча, ЧувствительныеДанные,
// РазмерМетаданных. Размер $metadata оценивается сборкой модели и документа (секунды на полном составе);
// Оценка — уже известная оценка, чтобы не считать её повторно.
Функция Предупреждения(Состав, Оценка = Неопределено) Экспорт
	Результат = Новый Массив;
	Если Состав.Количество() = 0 Тогда
		ДобавитьПредупреждение(Результат, "ПустойСостав", "", "Состав пуст: сервис ничего не публикует");
		Возврат Результат;
	КонецЕсли;
	Стандартный = СоставСтандартногоИнтерфейса();
	Имена = Новый Массив;
	Для Каждого КлючИЗначение Из Состав Цикл
		Имена.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	Для Каждого ПолноеИмя Из OData4_Модель.УпорядочитьСтроки(Имена) Цикл
		ПредупрежденияОбъекта(Результат, ПолноеИмя, Состав.Получить(ПолноеИмя), Стандартный);
	КонецЦикла;
	Если Оценка = Неопределено Тогда
		Оценка = ОценкаРазмераМетаданных(Состав);
	КонецЕсли;
	Порог = ПорогРазмераМетаданных();
	Если Оценка > Порог Тогда
		ДобавитьПредупреждение(Результат, "РазмерМетаданных", "", СтрШаблон(
			"Оценка размера $metadata %1 МБ выше порога %2 МБ: Power BI и Excel долго загружают список таблиц",
			Формат(Оценка / 1048576, "ЧДЦ=1; ЧГ=0"), Формат(Порог / 1048576, "ЧДЦ=0; ЧГ=0")));
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Порог размера $metadata для предупреждения, байт.
Функция ПорогРазмераМетаданных() Экспорт
	Возврат 10 * 1024 * 1024;
КонецФункции

// Размер $metadata (CSDL XML, байт UTF-8) для состава: модель и документ строятся для текущего
// пользователя (права чтения влияют на состав модели).
Функция ОценкаРазмераМетаданных(Состав) Экспорт
	Текст = OData4_Метаданные.ДокументCSDL(OData4_Модель.Построить(Состав));
	Возврат ПолучитьДвоичныеДанныеИзСтроки(Текст, "UTF-8").Размер();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ключ состава при пустом регистре: «СИ» и версия снимка стандартного интерфейса (снимок входит в ключ модели).
// Снимка нет, а права есть — снимок записывается сейчас.
Функция КлючСтандартного()
	Версия = ВерсияСнимка();
	Если Версия = "" Тогда
		Попытка
			ОбновитьСнимокСтандартногоИнтерфейса();
			Версия = ВерсияСнимка();
		Исключение
			// Нет прав на состав платформы или на запись снимка: модель без снимка ответит 503.
			Версия = "";
		КонецПопытки;
	КонецЕсли;
	Возврат "СИ" + ?(Версия = "", "", ":" + Версия);
КонецФункции

// Имена объектов состава стандартного интерфейса: платформы (с обновлением снимка) или снимка; нет ни того, ни
// другого — 503.
Функция ИменаСтандартногоИнтерфейса()
	Имена = Неопределено;
	Попытка
		Имена = ИменаПлатформы();
	Исключение
		Имена = Неопределено;
	КонецПопытки;
	Если Имена <> Неопределено Тогда
		Попытка
			СохранитьСнимок(Имена);
		Исключение
			ЗаписьЖурналаРегистрации("OData4.Состав", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Снимок состава стандартного интерфейса не записан: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Возврат Имена;
	КонецЕсли;
	Возврат ИменаСнимка();
КонецФункции

// Имена объектов снимка состава стандартного интерфейса (запросом); снимка нет — 503.
Функция ИменаСнимка() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ С.ПолноеИмя КАК ПолноеИмя ИЗ РегистрСведений.OData4_СоставСтандартногоИнтерфейса КАК С
		|УПОРЯДОЧИТЬ ПО ПолноеИмя");
	Имена = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выгрузить().ВыгрузитьКолонку("ПолноеИмя");
	Если Имена.Количество() = 0 Тогда
		OData4_Сервис.ОшибкаOData(503, "ServiceUnavailable", "Состав стандартного интерфейса OData не сохранён: "
			+ "у пользователя нет прав его получить, а снимок ещё не записан (devcli snapshot или запрос администратора)");
	КонецЕсли;
	Возврат Имена;
КонецФункции

// Полные имена объектов публикуемых видов из ПолучитьСоставСтандартногоИнтерфейсаOData() по возрастанию.
Функция ИменаПлатформы()
	Список = Новый СписокЗначений;
	Для Каждого ОбъектМетаданных Из ПолучитьСоставСтандартногоИнтерфейсаOData() Цикл
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Если ПубликуемыйВид(ПолноеИмя) Тогда
			Список.Добавить(ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	Список.СортироватьПоЗначению();
	Возврат Список.ВыгрузитьЗначения();
КонецФункции

// Записывает снимок, если его версия отличается от сохранённой.
Процедура СохранитьСнимок(Имена)
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(СтрСоединить(Имена, Символы.ПС));
	Версия = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
	Если Версия = ВерсияСнимка() Тогда
		Возврат;
	КонецЕсли;
	Набор = РегистрыСведений.OData4_СоставСтандартногоИнтерфейса.СоздатьНаборЗаписей();
	Для Каждого ПолноеИмя Из Имена Цикл
		Запись = Набор.Добавить();
		Запись.ПолноеИмя = ПолноеИмя;
		Запись.Версия = Версия;
	КонецЦикла;
	Набор.Записать();
КонецПроцедуры

Процедура ДобавитьПредупреждение(Результат, Вид, Объект, Текст)
	Результат.Добавить(Новый Структура("Вид, Объект, Текст", Вид, Объект, Текст));
КонецПроцедуры

// Предупреждения одного объекта состава; Стандартный — состав стандартного интерфейса (Соответствие).
Процедура ПредупрежденияОбъекта(Результат, ПолноеИмя, Описание0, Стандартный) Экспорт
	Если Не ПубликуемыйВид(ПолноеИмя) Тогда
		ДобавитьПредупреждение(Результат, "НеПубликуется", ПолноеИмя, "Вид объекта не публикуется: " + ПолноеИмя);
		Возврат;
	КонецЕсли;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		ДобавитьПредупреждение(Результат, "НеПубликуется", ПолноеИмя, "Объект не найден в метаданных: " + ПолноеИмя);
		Возврат;
	ИначеЕсли СтрНачинаетсяС(ОбъектМетаданных.Имя, "OData4_") Тогда
		ДобавитьПредупреждение(Результат, "НеПубликуется", ПолноеИмя, "Объект расширения OData4 не публикуется: "
			+ ПолноеИмя);
		Возврат;
	КонецЕсли;
	Если Стандартный.Получить(ПолноеИмя) = Неопределено Тогда
		ДобавитьПредупреждение(Результат, "ВнеСтандартногоИнтерфейса", ПолноеИмя,
			"Объект вне стандартного интерфейса OData: имена построены по тем же правилам, но со standard.odata не сверены: "
			+ ПолноеИмя);
	КонецЕсли;
	Ключевые = ПоляКлючаОбъекта(ОбъектМетаданных, ПолноеИмя);
	Если Описание0 <> Неопределено Тогда
		Для Каждого Поле Из Описание0.ИсключённыеПоля Цикл
			ИмяПоля = ?(СтрНайти(Поле, ".") > 0, Сред(Поле, СтрНайти(Поле, ".") + 1), Поле);
			Если Ключевые.Найти(ИмяПоля) <> Неопределено Тогда
				ДобавитьПредупреждение(Результат, "ПолеКлюча", ПолноеИмя,
					"Поле ключа не исключается: " + ПолноеИмя + "." + Поле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Причина = ПричинаЧувствительности(ОбъектМетаданных, Описание0);
	Если Причина <> "" Тогда
		ДобавитьПредупреждение(Результат, "ЧувствительныеДанные", ПолноеИмя,
			"Объект может содержать чувствительные данные (" + Причина + "): рекомендуется ограничить профилем: "
			+ ПолноеИмя);
	КонецЕсли;
КонецПроцедуры

// Имена полей 1С, которые образуют ключ наборов объекта или связывают строки с владельцем.
Функция ПоляКлючаОбъекта(ОбъектМетаданных, ПолноеИмя)
	Ключевые = Новый Массив;
	Ключевые.Добавить("Ссылка");
	Ключевые.Добавить("НомерСтроки");
	Ключевые.Добавить("Регистратор");
	Вид = СтрРазделить(ПолноеИмя, ".")[0];
	Если Вид = "РегистрСведений" Тогда
		Ключевые.Добавить("Период");
		Для Каждого Поле Из ОбъектМетаданных.Измерения Цикл
			Ключевые.Добавить(Поле.Имя);
		КонецЦикла;
	КонецЕсли;
	Возврат Ключевые;
КонецФункции

// Причина считать объект чувствительным ("" — нет): подстрока в имени объекта или поля либо
// неисключённое поле типа ХранилищеЗначения.
Функция ПричинаЧувствительности(ОбъектМетаданных, Описание0)
	Подстроки = СтрРазделить("пароль,password,токен,token,секрет,secret,закрытыйключ,privatekey,паспорт,"
		+ "персональныеданные,безопасноехранилище,сертификат,данныекарты", ",");
	Для Каждого Подстрока Из Подстроки Цикл
		Если СтрНайти(НРег(ОбъектМетаданных.Имя), Подстрока) > 0 Тогда
			Возврат "имя объекта";
		КонецЕсли;
	КонецЦикла;
	Хранилище = Тип("ХранилищеЗначения");
	Для Каждого Поле Из ПоляОбъекта(ОбъектМетаданных) Цикл
		Если Описание0 <> Неопределено И Описание0.ИсключённыеПоля.Найти(Поле.Путь) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Подстрока Из Подстроки Цикл
			Если СтрНайти(НРег(Поле.Имя), Подстрока) > 0 Тогда
				Возврат "поле " + Поле.Путь;
			КонецЕсли;
		КонецЦикла;
		Если Поле.Тип <> Неопределено И Поле.Тип.СодержитТип(Хранилище) Тогда
			Возврат "хранилище значения " + Поле.Путь;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

// Поля объекта: Массив Структура("Имя, Путь, Тип") — реквизиты, измерения, ресурсы, реквизиты адресации,
// графы, значение константы и реквизиты табличных частей (Путь «ИмяТЧ.Реквизит»).
Функция ПоляОбъекта(ОбъектМетаданных)
	Поля = Новый Массив;
	Для Каждого ИмяКоллекции Из СтрРазделить("Реквизиты,Измерения,Ресурсы,РеквизитыАдресации", ",") Цикл
		Коллекция = Неопределено;
		Попытка
			Коллекция = ОбъектМетаданных[ИмяКоллекции];
		Исключение
			Продолжить;
		КонецПопытки;
		Для Каждого Поле Из Коллекция Цикл
			Поля.Добавить(Новый Структура("Имя, Путь, Тип", Поле.Имя, Поле.Имя, Поле.Тип));
		КонецЦикла;
	КонецЦикла;
	Если Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		Поля.Добавить(Новый Структура("Имя, Путь, Тип", "Значение", "Значение", ОбъектМетаданных.Тип));
	КонецЕсли;
	ТабличныеЧасти = Неопределено;
	Попытка
		ТабличныеЧасти = ОбъектМетаданных.ТабличныеЧасти;
	Исключение
		Возврат Поля;
	КонецПопытки;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		Для Каждого Поле Из ТабличнаяЧасть.Реквизиты Цикл
			Поля.Добавить(Новый Структура("Имя, Путь, Тип", Поле.Имя, ТабличнаяЧасть.Имя + "." + Поле.Имя, Поле.Тип));
		КонецЦикла;
	КонецЦикла;
	Возврат Поля;
КонецФункции

Функция СписокИмён(Текст)
	Имена = Новый Массив;
	Для Каждого Часть Из СтрРазделить(Текст, ",", Ложь) Цикл
		Имя = СокрЛП(Часть);
		Если Имя <> "" И Имена.Найти(Имя) = Неопределено Тогда
			Имена.Добавить(Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат Имена;
КонецФункции

#КонецОбласти
